Revit 2027 API
FabricationUtils.ExportToPCF Method
 Exports a list of fabrication parts into PCF format.
Namespace: Autodesk.Revit.DB.Fabrication
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static void ExportToPCF(
	Document document,
	IList<ElementId> ids,
	string filename
)
Public Shared Sub ExportToPCF (
	document As Document,
	ids As IList(Of ElementId),
	filename As String
)
public:
static void ExportToPCF(
	Document^ document,
	IList<ElementId^>^ ids,
	String^ filename
)
static member ExportToPCF :
        document : Document *
        ids : IList<ElementId> *
        filename : string -> unit
Parameters
document Document
 The document.
ids IList<ElementId>
 An array of FabricationPart element identifiers. Non-fabrication parts are ignored.
filename String
 The name given to the output file.
Exceptions
Exception | Condition
ArgumentException |  Fabrication configuration is missing.
ArgumentNullException |  A non-optional argument was null
See Also
Reference
FabricationUtils Class
Autodesk.Revit.DB.Fabrication Namespace